// -4 Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
//    Значення площі зберігати в змінній s.

let height = 23;
let width = 10;

let s = height * width;
//_________________________________________________________

// -5 Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.

let heightC = 10;
let dC = 4;


let v = ((3.14 * Math.pow((dC / 2), 2)) * heightC);

//console.log(v);
//_________________________________________________________________________________________________

// -6 У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
//    Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).

let n = 3;
let m = 4;

let k = Math.sqrt((Math.pow(n, 2)) + (Math.pow(m, 2)));
// console.log(k);