// -1  Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.

let arr = ['a', 'b', 'c'];
let numbers = [1, 2, 3];

for (let i = 0; i < numbers.length; i++) {
    arr.push(numbers[i]);
}
//console.log(arr);
//____________________________________________________________________

// -2 Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

let ar = [1, 2, 3];

for (let i = 0; i < ar.length; i++) {
    if (ar[i] == 1) {
        ar[i] = 3;
    } else if (ar[i] == 3) {
        ar[i] = 1;
    }
}
//console.log(ar);
//__________________________________________________________

// -3 Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

let num = [1, 2, 3];

num.push(4);
num.push(5);
num.push(6);

//console.log(num);
//___________________________________________________________

// -4 Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

let nums = [1, 2, 3];
let nu = [6, 5, 4];

for (let i = 0; i < nu.length; i++) {
    nums.unshift(nu[i]);
}

//console.log(nums);
//___________________________________________________________

// -5 Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

let letters = ['js', 'css', 'jq'];

let shifted = letters.shift();

//console.log(shifted);
//_________________________________________________________________________

// -6 Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

let letter = ['js', 'css', 'jq'];

let popped = letter.pop();

//console.log(popped);
//______________________________________________________________________

// -7 Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].

let n = [1, 2, 3, 4, 5];

for (let i = 0; i < n.length; i++) {
    n.shift();
}

//console.log(n);
//________________________________________________________________

// -8 Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1, 2].

let nn = [1, 2, 3, 4, 5];

for (let i = 0; i < nn.length; i++) {
    nn.pop();
}

//console.log(nn);
//__________________________________________________________________

// -9  Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].

let nm = [1, 2, 3, 4, 5];
let abc = ['a', 'b', 'c'];
let p = [];

for (let i = 2; i < nm.length; i++) {
    p.unshift(nm.pop());
}

for (let i = 0; i < abc.length; i++) {
    nm.push(abc[i]);
}

for (let i = 0; i < p.length; i++) {
    nm.push(p[i]);
}

//console.log(nm);
//_______________________________________________________________________

// -10 Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']

let mn = [1, 2, 3, 4, 5];
let acb = ['a', 'b', 'c', 'e'];
let o = [];

for (let i = 0; i < 1; i++) {
    o.unshift(mn.shift());
}

for (let i = 0; i < acb.length - 2; i++) {
    o.push(acb[i]);
}

for (let i = 0; i < mn.length - 1; i++) {
    o.push(mn[i]);
}

for (let i = 2; i < acb.length - 1; i++) {
    o.push(acb[i]);
}

for (let i = 3; i < mn.length; i++) {
    o.push(mn[i]);
}

for (let i = 3; i < acb.length; i++) {
    o.push(acb[i]);
}

//console.log(o);
//_______________________________________________________________________

// -11 Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

let q = [12, 3, 5, 1, 44, 8, 99, 2, 10, 30];

for (let i = 0; i < q.length; i++) {
    if (q[i] % 2 == 0) {
        //console.log(q[i]);
    }
}
//____________________________________________________________________

// -12 Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший

let w = [];

for (let i = 0; i < q.length; i++) {
    w.push(q[i]);
}

// console.log(w);
//________________________________________________________________

// -13 Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

let e = [];

for (let i = 0; i < q.length; i++) {
    e[i] = q[i];
}

// console.log(e);
