// --1 -створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let arr = [12, 2, 6, 0, -2];
let arr1 = ['Course', 'HP', 'Okten', 'Apple', 'laptop'];
let arr2 = ['Oleh', 20, true, 'iPhone', 12];

// console.log(arr);
// console.log(arr1);
// console.log(arr2);
//_____________________________________________________________

// --Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let array = [];
array [0] = 4;
array [1] = 'Lenovo';
array [2] = false;
array [3] = -11;

// console.log(array);