// -7 Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = [1, 4, 67, 32, 0, 97, 11, 8, 1111, 3];
//
// for (let i = 0; i < arr.length; i++) {
// console.log(arr[i]);
// }
//_____________________________________________________________________________________

// -8 Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = ['I', 'you', 'they', 'nice', 'IT', 'IOT', 'LP', 'NU', 'she', 'it'];
//
// for (let i = 0; i < arr.length; i++) {
// console.log(arr[i]);
// }
//________________________________________________________________________________________

// -9 Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі

// let arr = [12, 'you', true, 'nice', 'undefined', 'IOT', 33, 'NU', 'false', 'it'];
//
// for (let i = 0; i < arr.length; i++) {
// console.log(arr[i]);
// }
//_____________________________________________________________________________________________

// -10 Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let arr = [12, 'you', true, 'nice', 'undefined', 'IOT', 33, 'NU', false, 'it'];

// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] == "boolean"){
//         console.log(arr[i]);
//     }
// }

// -11 Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] == "number"){
//         console.log(arr[i]);
//     }
// }

// -12 Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] == "string"){
//         console.log(arr[i]);
//     }
// }