// -7 Напишите скрипт, который выводит "Hello world", создавши переменную str и выводить спомощью document.write, alert и console.log

let str = 'Hello world';

// document.write(str);
// alert(str);
// console.log(str);
//________________________________________________________

// -8 Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).

//alert('Сікірський Олег Марянович \n 20 лет \n путешествия');
//________________________________________________________________________________-

// -9  Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//   Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//   Вывести в документ содержимое переменной concatenation спомощью document.write

let str1;
let str2;
let str3;
let concatenation;

str1 = 'Кто ';
str2 = 'ты ';
str3 = 'такой';

concatenation = str1 + str2 + str3;

//document.write(concatenation);
