// -1 Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
//    За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.

let str = 'Привіт';
let num = 123;
let flag = true;
let txt = 'true';

// console.log(typeof str);
// console.log(typeof num);
// console.log(typeof flag);
// console.log(typeof txt);
// ________________________________________________________________________________________________________

// -2 Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//    34, 12, 66, 90, 87

let a1 = (10 + 7) * 2;
let a2 = 36 / 3;
let a3 = ((7 * 3) + 1) * 3;
let a4 = (9 ^ 2) + 9;
let a5 = (10 * 10) - 13;
//_____________________________________________________________________________________________________

// -3 Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'

let a6 = 2;
let a7 = 3;
let a8 = '53';
let a9 = 2;
let a10 = '75кг';