// -19 Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

// for (let m = 0; m < 3; m++) {
//     for (let s = 0; s < 60; s++) {
//         console.log(`${m} minutes ${s} seconds`);
//
//         if (m === 2  && s === 0){
//             break;
//         }
//     }
// }
//___________________________________________________________________________

// -20  Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

// for (let h = 0; h < 3; h++) {
//     for (let m = 0; m < 60; m++) {
//         for (let s = 0; s < 60; s++) {
//             console.log(`${h} hours ${m} minutes ${s} seconds`);
//
//             if (h === 2 && m === 20 && s === 0) {
//                 break;
//             }
//         }
//         if (h === 2 && m === 20) {
//             break;
//         }
//     }
// }