// -13 Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі

// let arr = [];
//
// arr[0] = 12;
// arr[1] = 'you';
// arr[2] = true;
// arr[3] = 'nuce';
// arr[4] = "undefined";
// arr[5] = 0;
// arr[6] = NaN;
// arr[7] = 'I';
// arr[8] = false;
// arr[9] = 'NU';
//
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }
//___________________________________________________________________________________

// -14 Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i++) {
//     console.log(i);
//     document.write(i);
// }
//_____________________________________________________________________________________

// -15  Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i++) {
//     console.log(i);
//     document.write(i);
// }
//____________________________________________________________________________________

// -16 Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i = i + 2) {
//     console.log(i);
//     document.write(i);
// }
//____________________________________________________________________________________

// -17 Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (let i = 0; i < 100; i = i + 2) {
//     if (i % 2 == 0) {
//         console.log(i);
//         document.write(i);
//     }
// }
//_______________________________________________________________________________________

// -18 Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 0; i < 100; i = i + 2) {
//     if (i % 2 !== 0) {
//         console.log(i);
//         document.write(i);
//     }
// }